[
  {
    "role": "Staff SDET",
    "company": "AlphaSense",
    "date": "March 2025 – Present",
    "details": [
      "Designed and rolled out a custom Playwright MCP Server used org-wide to generate base automation scripts in minutes, reducing test bootstrap time by 90%.",
      "Built backend E2E generators covering full API surfaces with contract testing and API testing capabilities, reducing manual test effort by 70-80%.",
      "Developed auto-regression analysis tooling to track failures and release trends, improving release management confidence by 40%.",
      "Designed auto-SDK pipelines detecting Swagger changes and automatically updating multi-language SDKs, reducing SDK maintenance overhead by 85%.",
      "Launched Slack automation apps to reduce manual intervention in support and operational workflows by 60%.",
      "Regularly debugged Spring Boot and Node.js services to distinguish test vs product issues and unblock releases, improving time-to-market by 25%.",
      "Acted as a quality architect influencing automation standards, test strategy, and continuous testing practices across teams."
    ]
  },
  {
    "role": "Team Lead – QA Automation",
    "company": "AlphaSense",
    "date": "Oct 2023 – March 2025",
    "details": [
      "Automated manual operational workflows using Slack-based automation, reducing response times by 65% and improving operational efficiency.",
      "Optimized cloud costs via cron-based cleanup and governance using Infrastructure as Code principles, saving $1K+ per month (12% reduction).",
      "Integrated cloud resources using Crossplane, enabling cloud-agnostic test execution across AWS, Azure, and GCP with 99.5% uptime.",
      "Implemented and enhanced Testkube with in-cluster testing, triggers, and reusable workflows, improving test observability by 50%.",
      "Shifted validation to build-level execution, strengthening CI/CD pipelines and reducing late failures by 45%.",
      "Designed Jenkins-based continuous testing pipelines focused on early defect detection and fast feedback within SDLC.",
      "Mentored QA engineers to independently own complex automation systems and cloud tooling, improving team autonomy by 60%."
    ]
  },
  {
    "role": "Senior Automation QA",
    "company": "AlphaSense",
    "date": "Jan 2022 – Sept 2023",
    "details": [
      "Led a team of 3 QA engineers and managed sprint planning and execution following Agile and Scrum methodologies.",
      "Built scalable automation frameworks using Java, JavaScript, Cypress, K6, and Selenide with test-driven development principles.",
      "Integrated post-deployment automation using Spinnaker for continuous testing and release management.",
      "Implemented performance testing strategies for microservices and SQS-based systems, identifying bottlenecks and improving throughput by 35%.",
      "Improved system reliability through proactive automation and performance insights, reducing production incidents by 30%."
    ]
  },
  {
    "role": "Automation QA",
    "company": "AlphaSense",
    "date": "Mar 2020 – Dec 2021",
    "details": [
      "Implemented frontend automation using Selenium (Java) and Selenide (Kotlin) with comprehensive API testing and contract testing coverage.",
      "Built backend API automation using Kotlin and RestAssured following shift-left testing practices.",
      "Automated GraphQL APIs and maintained large-scale regression suites (4K+ test cases) with 95% pass rate.",
      "Integrated Allure, ReportPortal, and Selenoid Grid for test observability, reporting, and execution scalability across multi-tenant architecture."
    ]
  },
  {
    "role": "QA Automation / Associate QA",
    "company": "Accenture",
    "date": "Jan 2017 – Mar 2020",
    "details": [
      "Automated 100+ healthcare web applications across enterprise client engagements following software quality assurance best practices.",
      "Executed E2E, regression, smoke, UAT, and UI testing within complete SDLC lifecycle.",
      "Worked on US government projects with strict compliance and quality standards, achieving 98% defect detection rate.",
      "Built strong foundations in enterprise QA processes, documentation, and quality engineering methodologies."
    ]
  }
]